a52dec
accountsservice
acl
adapta-gtk-theme
adobe-source-code-pro-fonts
alsa-card-profiles
alsa-firmware
alsa-lib
alsa-topology-conf
alsa-ucm-conf
alsa-utils
android-tools
aom
appstream
apr
apr-util
arch-install-scripts
archey3
archlinux-keyring
argon2
aribb24
aspell
assimp
atk
atkmm
attr
audit
augeas
aurpublish
autoconf
autoconf-archive
automake
avahi
babl
base
bash
bash-completion
bc
bchunk
bind
binutils
bison
blas
bluez-libs
bluez-utils
boost
boost-libs
breeze-icons
bridge-utils
brltty
brotli
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cantarell-fonts
cblas
ccid
cdparanoia
celt
celt0.5.1
ceph
ceph-libs
certbot
cifs-utils
cinnamon-menus
cinnamon-translations
clang
clucene
cmake
colord
compiler-rt
confuse
containerd
coordgen
coreutils
cpulimit
cracklib
crda
cronie
cryptsetup
curl
dav1d
db
dbus
dbus-c++
dbus-glib
dconf
desktop-file-utils
device-mapper
dhclient
dhcpcd
dialog
diffutils
djvulibre
dmd
dmidecode
dmraid
dnsmasq
dnssec-anchors
docbook-xml
docbook-xsl
docker
docker-compose
dos2unix
dosfstools
double-conversion
doxygen
e2fsprogs
ebtables
editorconfig-core-c
edk2-ovmf
efibootmgr
efivar
elfutils
enchant
exempi
exiv2
expat
extra-cmake-modules
faac
faad2
faenza-icon-theme
fakeroot
fcgi
fftw
file
filesystem
findutils
fish
flac
flex
fmt
fontconfig
freetype2
fribidi
fuse-common
fuse2
fuse3
gawk
gc
gcab
gcc
gcc-libs
gdbm
gendesk
gettext
giflib
git
glib-networking
glib-perl
glib2
glib2-docs
glibc
glibmm
glm
glslang
glusterfs
gmp
gn
gnome-backgrounds
gnome-common
gnupg
gnustep-base
gnutls
go
go-tools
gobject-introspection
gobject-introspection-runtime
gperf
gperftools
gpgme
gpm
gptfdisk
gradle
graphene
graphite
grep
groff
grub
gsettings-desktop-schemas
gsl
gsm
gstreamer
gtk-doc
gts
guile
gzip
harfbuzz
harfbuzz-icu
hdparm
hicolor-icon-theme
hspell
htop
http-parser
hunspell
hunspell-en_US
hwids
hwloc
hyphen
iana-etc
icoutils
icu
ijs
imagemagick-doc
inetutils
iniparser
intel-ucode
intltool
iproute2
iptables
iputils
iso-codes
itstool
iw
jansson
jasper
java-environment-common
java-runtime-common
jbig2dec
jdk-openjdk
jemalloc
jfsutils
jitterentropy
jmol
jq
jre-openjdk
jre-openjdk-headless
jre8-openjdk-headless
jruby
js68
js78
json-c
json-glib
jsoncpp
kbd
keyutils
kmod
krb5
l-smash
ladspa
lame
lapack
lcms2
ldb
ldns
lensfun
less
leveldb
lhasa
lib32-acl
lib32-atk
lib32-attr
lib32-bzip2
lib32-clang
lib32-colord
lib32-cracklib
lib32-curl
lib32-dbus
lib32-dconf
lib32-e2fsprogs
lib32-expat
lib32-fakeroot
lib32-flac
lib32-freetype2
lib32-fribidi
lib32-gcc-libs
lib32-gettext
lib32-giflib
lib32-glib2
lib32-glibc
lib32-gmp
lib32-gnutls
lib32-harfbuzz
lib32-icu
lib32-json-glib
lib32-keyutils
lib32-krb5
lib32-lcms2
lib32-libasyncns
lib32-libcap
lib32-libcroco
lib32-libcups
lib32-libdatrie
lib32-libdrm
lib32-libelf
lib32-libepoxy
lib32-libffi
lib32-libgcrypt
lib32-libgpg-error
lib32-libgudev
lib32-libgusb
lib32-libice
lib32-libidn
lib32-libidn2
lib32-libjpeg-turbo
lib32-libldap
lib32-libltdl
lib32-libnl
lib32-libnsl
lib32-libogg
lib32-libpcap
lib32-libpciaccess
lib32-libpng
lib32-libproxy
lib32-libpsl
lib32-libsm
lib32-libssh2
lib32-libtasn1
lib32-libthai
lib32-libtiff
lib32-libtirpc
lib32-libunistring
lib32-libunwind
lib32-libusb
lib32-libvorbis
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxdmcp
lib32-libxkbcommon
lib32-libxml2
lib32-libxshmfence
lib32-libxslt
lib32-llvm
lib32-llvm-libs
lib32-lm_sensors
lib32-lz4
lib32-ncurses
lib32-nettle
lib32-nspr
lib32-nss
lib32-ocl-icd
lib32-openal
lib32-openssl
lib32-orc
lib32-p11-kit
lib32-pam
lib32-pcre
lib32-pixman
lib32-polkit
lib32-readline
lib32-sqlite
lib32-systemd
lib32-tdb
lib32-util-linux
lib32-v4l-utils
lib32-vulkan-icd-loader
lib32-xz
lib32-zlib
lib32-zstd
libabw
libaio
libarchive
libassuan
libasyncns
libatasmart
libavc1394
libblockdev
libbsd
libbytesize
libcacard
libcap
libcap-ng
libcddb
libcdio
libcdio-paranoia
libcdr
libcmis
libconfig
libcroco
libcups
libdaemon
libdatrie
libdc1394
libdca
libde265
libdmtx
libdnet
libdrm
libdv
libdvbpsi
libdvdcss
libdvdnav
libdvdread
libe-book
libebml
libedit
libelf
libepoxy
libepubgen
libetonyek
libev
libevdev
libevent
libexif
libexttextcat
libfbclient
libfdk-aac
libffi
libfreehand
libftdi
libgadu
libgcrypt
libgee
libgexiv2
libgit2
libgme
libgnome-keyring
libgoom2
libgpg-error
libgsystem
libgtop
libgudev
libgusb
libheif
libibus
libical
libice
libid3tag
libidl2
libidn
libidn2
libiec61883
libimagequant
libimobiledevice
libinih
libinput
libiscsi
libixion
libjpeg-turbo
libkate
libksba
liblangtag
libldap
liblouis
liblqr
liblrdf
libluv
libmad
libmatroska
libmaxminddb
libmbim
libmicrodns
libmicrohttpd
libmm-glib
libmms
libmng
libmnl
libmodplug
libmp4v2
libmpc
libmpcdec
libmpeg2
libmspack
libmspub
libmtp
libmwaw
libnatpmp
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnl
libnm
libnm-glib
libnsl
libnumbertext
libodfgen
libofa
libogg
libomxil-bellagio
liborcus
libp11
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpgm
libphobos
libpipeline
libplist
libpng
libpng12
libproxy
libpsl
libpulse
libqalculate
libqmi
libqxp
libraqm
libraw
libraw1394
librdkafka
librevenge
libsamplerate
libsasl
libseccomp
libsecp256k1
libsecret
libshout
libsigc++
libsigsegv
libsm
libsndfile
libsodium
libsoup
libsoxr
libspeechd
libspiro
libsrtp
libssh
libssh2
libstaroffice
libstemmer
libsynctex
libtar
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libunistring
libunwind
libupnp
liburcu
liburing
libusb
libusb-compat
libusbmuxd
libutempter
libutf8proc
libuv
libvisio
libvisual
libvoikko
libvorbis
libvpx
libvterm
libwacom
libwebp
libwpd
libwpg
libwps
libx11
libxau
libxcb
libxcomposite
libxcrypt
libxdg-basedir
libxdmcp
libxext
libxfce4util
libxfixes
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxml++
libxml2
libxrender
libxshmfence
libxslt
libxtst
libxxf86vm
libyaml
libzip
libzmf
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-headers
linux-zen
linux-zen-headers
live-media
lld
llvm
llvm-libs
lm_sensors
lmdb
logrotate
lpsolve
lsb-release
lsof
lua
lua-socket
lua52
luajit
lv2
lvm2
lz4
lzo
m4
maeparser
mailcap
make
mallard-ducktype
man-db
man-pages
mariadb-libs
materia-kde
mdadm
mdf2iso
media-player-info
meson
metis
minizip
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mozilla-common
mpfr
msgpack-c
mtdev
namcap
nano
ncurses
ndctl
neofetch
neon
neovim
netcf
netctl
netpbm
nettle
networkmanager
nghttp2
ninja
node-gyp
nodejs-lts-erbium
npm
npth
nsd
nspr
nss
ntfs-3g
numactl
oath-toolkit
ocl-icd
oniguruma
openal
openbabel
opencl-headers
opencore-amr
opendht
openexr
openjpeg2
openmpi
openresolv
opensc
openssh
openssl
openssl-1.0
opus
opusfile
orc
osinfo-db
p11-kit
p7zip
pacman
pacman-contrib
pacman-mirrorlist
pam
pambase
pamixer
parted
patch
patchelf
pciutils
pcre
pcre2
pcsc-perl
pcsc-tools
pcsclite
perl
perl-clone
perl-digest-hmac
perl-digest-sha1
perl-encode-locale
perl-error
perl-file-listing
perl-file-which
perl-html-parser
perl-html-tagset
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-io-socket-ssl
perl-io-string
perl-libwww
perl-lwp-mediatypes
perl-lwp-protocol-https
perl-mailtools
perl-net-http
perl-net-ssleay
perl-parse-yapp
perl-test-pod
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
perl-xml-parser
pinentry
pixman
pixz
pkgconf
pkgfile
polkit
poppler-data
popt
postgresql-libs
potrace
powertop
procps-ng
protobuf
protobuf-c
psmisc
pyalpm
python
python-acme
python-anytree
python-appdirs
python-asn1crypto
python-attrs
python-babel
python-bcrypt
python-beaker
python-beautifulsoup4
python-cachecontrol
python-cached-property
python-cffi
python-chardet
python-click
python-cmd2
python-colorama
python-configargparse
python-configobj
python-contextlib2
python-cryptography
python-dateutil
python-dbus
python-dbus-common
python-distlib
python-distro
python-docker
python-docker-pycreds
python-dockerpty
python-docopt
python-docutils
python-dotenv
python-flask
python-future
python-gobject
python-html5lib
python-idna
python-imagesize
python-importlib-metadata
python-isodate
python-itsdangerous
python-jinja
python-josepy
python-jsonschema
python-logutils
python-lxml
python-mako
python-markdown
python-markupsafe
python-mock
python-more-itertools
python-msgpack
python-numpy
python-openbabel
python-ordered-set
python-packaging
python-pam
python-paramiko
python-parsedatetime
python-pbr
python-pecan
python-pep517
python-pexpect
python-pillow
python-pip
python-ply
python-prettytable
python-progress
python-psutil
python-ptyprocess
python-pyaml
python-pyasn1
python-pycparser
python-pyelftools
python-pygments
python-pyinotify
python-pynacl
python-pyopenssl
python-pyparsing
python-pyperclip
python-pyrfc3339
python-pyrsistent
python-pytz
python-rdflib
python-requests
python-requests-toolbelt
python-resolvelib
python-retrying
python-setproctitle
python-setuptools
python-six
python-snowballstemmer
python-soupsieve
python-sphinx
python-sphinx-alabaster-theme
python-sphinx_rtd_theme
python-sphinxcontrib-applehelp
python-sphinxcontrib-devhelp
python-sphinxcontrib-htmlhelp
python-sphinxcontrib-jsmath
python-sphinxcontrib-qthelp
python-sphinxcontrib-serializinghtml
python-sqlalchemy
python-texttable
python-toml
python-urllib3
python-waitress
python-wcwidth
python-webencodings
python-webob
python-websocket-client
python-webtest
python-werkzeug
python-whoosh
python-xapp
python-yaml
python-zipp
python-zope-component
python-zope-deferredimport
python-zope-deprecation
python-zope-event
python-zope-hookable
python-zope-interface
python-zope-proxy
python2
python2-apipkg
python2-appdirs
python2-asn1crypto
python2-atomicwrites
python2-attrs
python2-backports
python2-backports.functools_lru_cache
python2-backports.unittest_mock
python2-bcrypt
python2-beautifulsoup4
python2-cffi
python2-chardet
python2-cheroot
python2-cherrypy
python2-configparser
python2-contextlib2
python2-cryptography
python2-dbus
python2-enum34
python2-feedparser
python2-funcsigs
python2-gobject
python2-idna
python2-importlib-metadata
python2-importlib_resources
python2-iniconfig
python2-ipaddress
python2-jaraco
python2-jinja
python2-markupsafe
python2-mock
python2-more-itertools
python2-numpy
python2-ordered-set
python2-packaging
python2-pathlib2
python2-pbr
python2-pillow
python2-pluggy
python2-ply
python2-portend
python2-py
python2-pycparser
python2-pyopenssl
python2-pyparsing
python2-pytest
python2-pytest-timeout
python2-pytz
python2-pyxdg
python2-requests
python2-scandir
python2-selectors2
python2-setuptools
python2-singledispatch
python2-six
python2-soupsieve
python2-tempora
python2-typing
python2-urllib3
python2-wcwidth
python2-wheel
python2-zc.lockfile
python2-zipp
qemu-block-gluster
qemu-block-iscsi
qemu-block-rbd
qpdf
qrencode
raptor
rasqal
re2
readline
redland
reflector
reiserfsprogs
rhash
rng-tools
rpcbind
rsync
rtkit
rtl-sdr
rtmpdump
ruby
ruby-bundler
ruby-irb
ruby-msgpack
ruby-multi_json
ruby-reline
rubygems
run-parts
runc
rxvt-unicode-terminfo
s-nail
samba
sbc
scons
screen
screenfetch
seabios
sed
semver
serd
serf
shaderc
shadow
shared-mime-info
slang
smbclient
snappy
sndio
sord
sound-theme-freedesktop
soundtouch
source-highlight
spandsp
speex
speexdsp
spice
spirv-tools
sqlite
sratom
srt
sslh
sstp-client
subversion
sudo
suitesparse
swig
sysfsutils
systemd
systemd-libs
systemd-sysvcompat
taglib
talloc
tar
tbb
tcl
tdb
tevent
texinfo
thin-provisioning-tools
transmission-cli
tree
tslib
ttf-hanazono
ttf-inconsolata
tzdata
uchardet
udisks2
unarchiver
unibilium
unixodbc
unrar
unzip
upower
uriparser
usbmuxd
usbredir
usbutils
util-linux
util-linux-libs
v4l-utils
vcdimager
vde2
vid.stab
volume_key
vte-common
vulkan-headers
vulkan-icd-loader
wavpack
webrtc-audio-processing
wget
which
wireless-regdb
woff2
wpa_supplicant
wxgtk-common
x264
x265
xbitmaps
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-dbus-proxy
xfce4-dev-tools
xfconf
xfsprogs
xkeyboard-config
xmlsec
xmlto
xorg-xdpyinfo
xorg-xprop
xorgproto
xvidcore
xxhash
xz
yajl
yaml-cpp
yasm
yelp-tools
yelp-xsl
youtube-dl
zeromq
zinnia
zip
zita-resampler
zlib
zsh
zstd
zziplib
