a2ps
a52dec
aalib
acl
acpi
acpi_call
acpid
adapta-gtk-theme
adobe-source-code-pro-fonts
adwaita-icon-theme
alacritty
alltray
alsa-card-profiles
alsa-firmware
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
amd-ucode
aom
arandr
arc-gtk-theme
arc-icon-theme
arch-install-scripts
archey3
archlinux-keyring
archlinux-wallpaper
argon2
aria2
aribb24
asar
aspell
at-spi2-atk
at-spi2-core
atk
atkmm
attica
attr
audit
augeas
autoconf
autoconf-archive
automake
autorandr
avahi
base
bash
bc
binutils
bison
blas
blueberry
bluez
bluez-libs
bluez-tools
bluez-utils
boost
boost-libs
bridge-utils
brightnessctl
brotli
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cabextract
cairo
cairomm
cantarell-fonts
cbatticon
cblas
ccache
ccls
cdparanoia
celt
ceph-libs
chromaprint
chrono-date
cifs-utils
clang
clucene
cmake
colord
compiler-rt
containerd
coreutils
cpio
cracklib
cryptsetup
ctemplate
cunit
cups
cups-filters
cups-pdf
curl
dav1d
db
dbus
dbus-glib
dconf
debootstrap
desktop-file-utils
device-mapper
dhcpcd
dialog
diffutils
discord
djvulibre
dkms
dmapi
dmidecode
dmraid
dnsmasq
dnssec-anchors
docbook-xml
docbook-xsl
docker
docker-compose
dos2unix
dosfstools
double-conversion
doxygen
dqlite
dunst
e2fsprogs
ebtables
efibootmgr
efivar
elfutils
enchant
ethtool
evince
evolution-data-server
exo
expat
extra-cmake-modules
faac
faad2
fakeroot
faudio
fcitx
fcitx-configtool
fcitx-mozc
fcitx-qt5
fcitx-ui-light
feh
ffmpeg
fftw
file
filesystem
findutils
firefox
firefox-i18n-ja
flac
flex
fluidsynth
fmt
folks
fontconfig
fontforge
freetype2
fribidi
fuse-common
fuse2
fuse3
garcon
gawk
gc
gcc
gcc-libs
gcr
gd
gdb
gdb-common
gdbm
gdk-pixbuf2
geary
gendesk
geoclue
geocode-glib
gettext
ghostscript
giflib
git
glade
glib-networking
glib2
glib2-docs
glibc
glibmm
glm
glslang
glu
glusterfs
gmime
gmime3
gmp
gnome-bluetooth
gnome-common
gnome-desktop
gnome-icon-theme
gnome-icon-theme-symbolic
gnome-keyring
gnome-online-accounts
gnome-themes-extra
gnu-free-fonts
gnupg
gnutls
go
go-md2man
gobject-introspection
gobject-introspection-runtime
gopls
gparted
gperf
gpgme
gpm
gptfdisk
graphene
graphite
graphviz
grep
groff
grub
gsettings-desktop-schemas
gsfonts
gsm
gsound
gspell
gssdp
gst-libav
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gst-plugins-ugly
gstreamer
gtest
gtk-doc
gtk-engine-murrine
gtk-layer-shell
gtk-update-icon-cache
gtk2
gtk3
gtkmm3
gts
guile
guile2.0
gumbo-parser
gupnp
gupnp-igd
gvfs
gvfs-smb
gzip
harfbuzz
harfbuzz-icu
hdparm
help2man
hicolor-icon-theme
hidapi
hspell
htop
http-parser
hunspell
hwids
hwloc
hyphen
iana-etc
icu
ijs
imagemagick
imlib2
inetutils
iniparser
intltool
iproute2
iptables
iputils
iso-codes
itstool
iw
jack
jansson
jasper
java-runtime-common
jbig2dec
jq
js68
js78
json-c
json-glib
jsoncpp
karchive
kauth
kbd
kbookmarks
kcm-fcitx
kcmutils
kcodecs
kcompletion
kconfig
kconfigwidgets
kcoreaddons
kcrash
kdbusaddons
kdeclarative
kded
keyutils
kglobalaccel
kguiaddons
ki18n
kiconthemes
kio
kitemviews
kjobwidgets
kmix
kmod
knewstuff
knotifications
kpackage
krb5
kservice
ktextwidgets
kwallet
kwidgetsaddons
kwindowsystem
kxmlgui
l-smash
ladspa
lame
lapack
lcms2
ldb
ldns
less
lib32-gcc-libs
lib32-glibc
libabw
libaio
libao
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavtp
libblockdev
libbluray
libbs2b
libbsd
libbytesize
libcaca
libcanberra
libcap
libcap-ng
libcddb
libcdio
libcdio-paranoia
libcdr
libclc
libcloudproviders
libcmis
libconfig
libcroco
libcups
libcurl-compat
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libdc1394
libdca
libde265
libdrm
libdv
libdvbpsi
libdvdnav
libdvdread
libe-book
libebml
libedit
libelf
libepoxy
libepubgen
libetonyek
libev
libevdev
libevent
libexif
libexttextcat
libfdk-aac
libffi
libfontenc
libfreehand
libgcrypt
libgdata
libgee
libglade
libglvnd
libgme
libgnome-keyring
libgnomekbd
libgpg-error
libgphoto2
libgssglue
libgtop
libgudev
libgusb
libgweather
libgxps
libhandy
libhandy0
libibus
libical
libice
libid3tag
libidn
libidn2
libiec61883
libieee1284
libimobiledevice
libindicator-gtk3
libinih
libinput
libinstpatch
libiscsi
libixion
libjpeg-turbo
libkate
libkeybinder3
libksba
liblangtag
libldap
liblouis
liblqr
liblrdf
libluv
libmad
libmateweather
libmatroska
libmfx
libmicrodns
libmicrohttpd
libmm-glib
libmms
libmnl
libmodplug
libmpack
libmpc
libmpcdec
libmpdclient
libmpeg2
libmspub
libmwaw
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnice
libnih
libnl
libnm
libnma
libnotify
libnsl
libnumbertext
liboauth
libodfgen
libofa
libogg
libomxil-bellagio
liborcus
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpeas
libpgm
libphonenumber
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libpwquality
libqxp
libraqm
libraw1394
libreoffice-still
libreoffice-still-ja
librevenge
librsvg
libsamplerate
libsasl
libsass
libseccomp
libsecret
libshout
libsidplay
libsigc++
libsigsegv
libsm
libsndfile
libsodium
libsoup
libsoxr
libspectre
libspiro
libsrtp
libssh
libssh2
libstaroffice
libstemmer
libsynctex
libtar
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtiger
libtirpc
libtommath
libtool
libuninameslist
libunistring
libunwind
libupnp
liburcu
liburing
libusb
libusb-compat
libusbmuxd
libutempter
libutf8proc
libuv
libva
libvdpau
libvisio
libvisual
libvoikko
libvorbis
libvpx
libvterm
libwacom
libwebp
libwnck
libwnck3
libwpd
libwpe
libwpg
libwps
libx11
libx86
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxdamage
libxdg-basedir
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmu
libxnvctrl
libxpm
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libytnef
libzmf
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-headers
linux-lts
linux-lts-headers
llvm-libs
lm_sensors
lmdb
lpsolve
lua
lua51
lua51-lpeg
lua51-mpack
lua52
luajit
luit
lv2
lvm2
lxc
lxcfs
lxd
lz4
lzo
m4
mailcap
make
mallard-ducktype
mate-desktop
mate-menus
mate-panel
mate-power-manager
mate-sensors-applet
materia-gtk-theme
md4c
mdadm
media-player-info
mesa
meson
minizip
mjpegtools
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mpfr
mpg123
mpv
msgpack-c
mtdev
mujs
mupdf
ncurses
ndctl
neon
neovim
net-snmp
netcf
netpbm
nettle
network-manager-applet
networkmanager
ninja
nm-connection-editor
node-gyp
nodejs
nodm
noto-fonts
npm
npth
nspr
nss
ntfs-3g
nvme-cli
oath-toolkit
oniguruma
openal
opencl-mesa
opencore-amr
openexr
openjpeg2
openmpi
openssh
openssl
opera-ffmpeg-codecs
opus
orc
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pahole
pam
pambase
pango
pangomm
paper
papirus-icon-theme
parted
pasystray
patch
pciutils
pcre
pcre2
pcsclite
perl
perl-capture-tiny
perl-clone
perl-encode-locale
perl-error
perl-file-listing
perl-file-which
perl-html-parser
perl-html-tagset
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-ipc-run3
perl-libwww
perl-locale-gettext
perl-lwp-mediatypes
perl-mailtools
perl-net-http
perl-parse-yapp
perl-rename
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
perl-xml-parser
picom
pinentry
pixman
pkgconf
pm2ml
polkit
polkit-qt5
poppler
poppler-glib
popt
portaudio
potrace
powerpill
procps-ng
protobuf
psmisc
psutils
pulseaudio
pulseaudio-alsa
pulseaudio-bluetooth
pyalpm
python
python-anytree
python-appdirs
python-asn1crypto
python-attrs
python-babel
python-bcrypt
python-beaker
python-cached-property
python-cairo
python-cffi
python-chardet
python-click
python-cryptography
python-dbus
python-dbus-common
python-distro
python-docker
python-docker-pycreds
python-dockerpty
python-docopt
python-docutils
python-dotenv
python-fonttools
python-gobject
python-greenlet
python-idna
python-imagesize
python-importlib-metadata
python-jinja
python-jsonschema
python-lxml
python-mako
python-markdown
python-markupsafe
python-more-itertools
python-msgpack
python-ordered-set
python-packaging
python-paramiko
python-ply
python-pycparser
python-pycups
python-pycurl
python-pygments
python-pynacl
python-pynvim
python-pyparsing
python-pyrsistent
python-pytz
python-pyxdg
python-requests
python-setproctitle
python-setuptools
python-six
python-snowballstemmer
python-sphinx
python-sphinx-alabaster-theme
python-sphinx_rtd_theme
python-sphinxcontrib-applehelp
python-sphinxcontrib-devhelp
python-sphinxcontrib-htmlhelp
python-sphinxcontrib-jsmath
python-sphinxcontrib-qthelp
python-sphinxcontrib-serializinghtml
python-texttable
python-urllib3
python-websocket-client
python-yaml
python-zipp
python2
python2-appdirs
python2-cairo
python2-numpy
python2-ordered-set
python2-packaging
python2-pyparsing
python2-setuptools
python2-six
python3-memoizedb
python3-xcgf
python3-xcpf
qpdf
qt5-base
qt5-declarative
qt5-location
qt5-multimedia
qt5-quickcontrols
qt5-speech
qt5-svg
qt5-tools
qt5-wayland
qt5-webchannel
qt5-webengine
qt5-x11extras
r
radeontool
raft
rapidjson
raptor
rasqal
rav1e
rdesktop
re2
readline
redland
reflector
remmina
rest
rhash
rofi
rpcbind
rsync
rtkit
rtmpdump
rubberband
ruby
ruby-irb
ruby-reline
rubygems
run-parts
runc
rust
rxvt-unicode
rxvt-unicode-terminfo
sakura
samba
sane
sassc
sbc
scdoc
schroedinger
screen
sddm
sdl
sdl2
sdl2_image
seahorse
sed
semver
serd
shaderc
shadow
shared-mime-info
slang
smartmontools
smbclient
snappy
sndio
solid
sonnet
sord
sound-theme-freedesktop
soundtouch
source-highlight
spandsp
spdlog
speex
speexdsp
spirv-tools
sqlite
squashfs-tools
sratom
srt
stalonetray
startup-notification
sudo
svt-hevc
sway
swaybg
swayidle
swaylock
sysfsutils
system-config-printer
systemd
systemd-libs
systemd-sysvcompat
t1lib
taglib
talloc
tar
tdb
telepathy-glib
tevent
texinfo
texlab
texlive-bibtexextra
texlive-bin
texlive-core
texlive-fontsextra
texlive-formatsextra
texlive-games
texlive-humanities
texlive-langjapanese
texlive-latexextra
texlive-music
texlive-pictures
texlive-pstricks
texlive-publishers
texlive-science
thin-provisioning-tools
thunar
tidy
tlp
tp_smapi
tracker3
tree
tslib
ttf-dejavu
ttf-inconsolata
ttf-liberation
twolame
tzdata
uchardet
udisks2
unibilium
unzip
upower
urxvt-perls
usbmuxd
usbutils
util-linux
util-linux-libs
v4l-utils
vamp-plugin-sdk
vid.stab
virtualbox
virtualbox-guest-iso
virtualbox-host-dkms
vlc
vmaf
volume_key
vte-common
vte3
vulkan-icd-loader
vulkan-radeon
w3m
wavpack
waybar
wayland
wayland-protocols
webkit2gtk
webrtc-audio-processing
wget
which
wildmidi
wireless_tools
wlroots
wmctrl
woff2
wpa_supplicant
wpebackend-fdo
wxgtk-common
wxgtk2
x264
x265
xapp
xbitmaps
xcb-proto
xcb-util
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xclip
xdg-dbus-proxy
xdg-utils
xdotool
xf86-input-libinput
xf86-video-amdgpu
xfce4-dev-tools
xfce4-panel
xfce4-power-manager
xfce4-pulseaudio-plugin
xfce4-screenshooter
xfconf
xfsdump
xfsprogs
xkeyboard-config
xmlsec
xmlto
xorg-fonts-encodings
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xdpyinfo
xorg-xinit
xorg-xkbcomp
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorg-xwayland
xorgproto
xsel
xterm
xvidcore
xxhash
xz
yasm
yelp-tools
yelp-xsl
youtube-dl
zbar
zeromq
zinnia
zip
zita-alsa-pcmi
zita-resampler
zlib
zsh
zstd
zvbi
zxing-cpp
zziplib
