a2ps
a52dec
aalib
acl
acpi
acpi_call
acpid
adapta-gtk-theme
adobe-source-code-pro-fonts
adobe-source-han-sans-jp-fonts
adobe-source-han-sans-otc-fonts
adobe-source-han-serif-jp-fonts
adobe-source-han-serif-otc-fonts
adwaita-icon-theme
alacritty
alltray
alsa-card-profiles
alsa-firmware
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
amd-ucode
amtk
aom
arandr
arc-gtk-theme
arc-icon-theme
arch-install-scripts
archey3
archlinux-keyring
archlinux-wallpaper
argon2
aria2
aribb24
asar
asp
aspell
at-spi2-atk
at-spi2-core
atk
atkmm
attica
attr
audacity
audit
augeas
autoconf
autoconf-archive
automake
autorandr
avahi
awesome-terminal-fonts
base
bash
bc
bind
binutils
bison
blas
blueberry
bluez
bluez-libs
bluez-tools
bluez-utils
boost
boost-libs
bridge-utils
brltty
brotli
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cabextract
cairo
cairomm
cantarell-fonts
cblas
ccache
ccid
ccls
cdparanoia
celt
ceph-libs
chromaprint
chrono-date
cifs-utils
clang
clucene
cmake
code
colord
compface
compiler-rt
confuse
containerd
coreutils
cpio
cracklib
cryptsetup
ctemplate
cunit
cups
cups-filters
cups-pdf
curl
dav1d
db
dbus
dbus-glib
dconf
debootstrap
deepin-desktop-base
deepin-qt-dbus-factory
deepin-qt5integration
deepin-qt5platform-plugins
desktop-file-utils
device-mapper
dhcpcd
dialog
diffutils
discord
djvulibre
dmapi
dmenu
dmidecode
dmraid
dnsmasq
dnssec-anchors
docbook-xml
docbook-xsl
docbook2x
docker
docker-compose
dos2unix
dosfstools
double-conversion
dqlite
dtc
dtkcore
dtkgui
dtkwidget
dunst
e2fsprogs
ebtables
edk2-ovmf
efibootmgr
efivar
egl-wayland
eglexternalplatform
electron
electron9
elfutils
enca
enchant
ethtool
evince
evolution-data-server
exo
expat
faac
faad2
fakeroot
faudio
fcitx
fcitx-configtool
fcitx-mozc
fcitx-qt5
fcitx-ui-light
feh
ffmpeg
ffmpegthumbnailer
fftw
file
filesystem
findutils
firefox
firefox-i18n-ja
flac
flex
fluidsynth
fmt
folks
fontconfig
fontforge
freeglut
freerdp
freetype2
fribidi
fuse-common
fuse2
fuse3
garcon
gawk
gc
gcc
gcc-libs
gcr
gd
gdbm
gdk-pixbuf2
geary
gedit
gendesk
geoclue
geocode-glib
geoip
geoip-database
gettext
ghc
ghc-libs
ghostscript
giflib
git
glib-networking
glib-perl
glib2
glib2-docs
glibc
glibmm
glm
glslang
glu
glusterfs
gmime
gmime3
gmp
gnome-bluetooth
gnome-common
gnome-desktop
gnome-icon-theme-symbolic
gnome-keyring
gnome-online-accounts
gnome-themes-extra
gnu-free-fonts
gnupg
gnustep-base
gnutls
go
go-md2man
gobject-introspection
gobject-introspection-runtime
gparted
gperf
gpgme
gpm
gptfdisk
graphene
graphite
graphviz
grep
groff
grub
gsettings-desktop-schemas
gsettings-qt
gsfonts
gsm
gsound
gspell
gssdp
gst-libav
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gst-plugins-ugly
gstreamer
gtest
gtk-doc
gtk-engine-murrine
gtk-layer-shell
gtk-update-icon-cache
gtk-vnc
gtk2
gtk3
gtkmm3
gtksourceview4
gtkspell
gts
guile
gumbo-parser
gupnp
gupnp-igd
gvfs
gzip
harfbuzz
harfbuzz-icu
haskell-adjunctions
haskell-aeson
haskell-alsa-core
haskell-alsa-mixer
haskell-asn1-encoding
haskell-asn1-parse
haskell-asn1-types
haskell-assoc
haskell-async
haskell-attoparsec
haskell-base-compat
haskell-base-compat-batteries
haskell-base-orphans
haskell-basement
haskell-bifunctors
haskell-blaze-builder
haskell-blaze-html
haskell-blaze-markup
haskell-byteable
haskell-call-stack
haskell-case-insensitive
haskell-cereal
haskell-comonad
haskell-conduit
haskell-conduit-extra
haskell-connection
haskell-contravariant
haskell-cookie
haskell-cryptonite
haskell-data-default
haskell-data-default-class
haskell-data-default-instances-containers
haskell-data-default-instances-dlist
haskell-data-default-instances-old-locale
haskell-data-fix
haskell-dbus
haskell-distributive
haskell-dlist
haskell-extensible-exceptions
haskell-free
haskell-hashable
haskell-hinotify
haskell-hourglass
haskell-http
haskell-http-client
haskell-http-client-tls
haskell-http-conduit
haskell-http-types
haskell-indexed-traversable
haskell-integer-logarithms
haskell-invariant
haskell-kan-extensions
haskell-lens
haskell-libmpd
haskell-memory
haskell-mime-types
haskell-monad-loops
haskell-mono-traversable
haskell-netlink
haskell-network
haskell-network-uri
haskell-old-locale
haskell-old-time
haskell-parallel
haskell-parsec-numbers
haskell-pem
haskell-pretty-hex
haskell-primitive
haskell-profunctors
haskell-random
haskell-reflection
haskell-regex-base
haskell-regex-compat
haskell-regex-posix
haskell-resourcet
haskell-safe-exceptions
haskell-scientific
haskell-semigroupoids
haskell-setlocale
haskell-socks
haskell-split
haskell-splitmix
haskell-statevar
haskell-streaming-commons
haskell-strict
haskell-tagged
haskell-th-abstraction
haskell-th-lift
haskell-these
haskell-time-compat
haskell-timezone-olson
haskell-timezone-series
haskell-tls
haskell-transformers-base
haskell-transformers-compat
haskell-typed-process
haskell-unliftio-core
haskell-unordered-containers
haskell-utf8-string
haskell-uuid-types
haskell-vector
haskell-vector-algorithms
haskell-void
haskell-x11
haskell-x11-xft
haskell-x509
haskell-x509-store
haskell-x509-system
haskell-x509-validation
haskell-xml-conduit
haskell-xml-types
haskell-zlib
hdparm
help2man
hicolor-icon-theme
hidapi
hspell
htop
http-parser
hugo
hunspell
hwids
hwloc
hyphen
iana-etc
icu
ijs
imagemagick
imlib2
inetutils
iniparser
intltool
iproute2
iptables
iputils
iso-codes
itstool
iw
jack2
jansson
jasper
java-runtime-common
jbig2dec
jq
jre-openjdk
jre-openjdk-headless
jre8-openjdk-headless
jruby
js78
json-c
json-glib
jsoncpp
karchive
kauth
kbd
kbookmarks
kcm-fcitx
kcmutils
kcodecs
kcompletion
kconfig
kconfigwidgets
kcoreaddons
kcrash
kdbusaddons
kdeclarative
kded
keyutils
kglobalaccel
kguiaddons
ki18n
kiconthemes
kio
kitemviews
kjobwidgets
kmod
knewstuff
knotifications
kpackage
krb5
kservice
ktextwidgets
kwallet
kwayland
kwidgetsaddons
kwindowsystem
kxmlgui
l-smash
ladspa
lame
lapack
lcms2
ldb
ldns
less
lib32-acl
lib32-attr
lib32-bzip2
lib32-celt
lib32-curl
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-fakeroot
lib32-faudio
lib32-fontconfig
lib32-freetype2
lib32-gcc-libs
lib32-gettext
lib32-glib2
lib32-glibc
lib32-glu
lib32-gmp
lib32-gnutls
lib32-harfbuzz
lib32-icu
lib32-jack2
lib32-keyutils
lib32-krb5
lib32-lcms2
lib32-libcap
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libgcrypt15
lib32-libglvnd
lib32-libgpg-error
lib32-libice
lib32-libidn2
lib32-libjpeg-turbo
lib32-libldap
lib32-libnl
lib32-libnsl
lib32-libpcap
lib32-libpciaccess
lib32-libpng
lib32-libpng12
lib32-libpsl
lib32-libsm
lib32-libssh2
lib32-libtasn1
lib32-libtiff
lib32-libtirpc
lib32-libunistring
lib32-libunwind
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcomposite
lib32-libxcrypt
lib32-libxcursor
lib32-libxdamage
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxi
lib32-libxinerama
lib32-libxml2
lib32-libxrandr
lib32-libxrender
lib32-libxshmfence
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-lz4
lib32-mesa
lib32-ncurses
lib32-nettle
lib32-ocl-icd
lib32-openal
lib32-openssl
lib32-opus
lib32-p11-kit
lib32-pam
lib32-pcre
lib32-readline
lib32-sdl2
lib32-systemd
lib32-util-linux
lib32-v4l-utils
lib32-vkd3d
lib32-vulkan-icd-loader
lib32-wayland
lib32-xz
lib32-zlib
lib32-zstd
libabw
libaio
libao
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavtp
libblockdev
libbluray
libbs2b
libbsd
libbytesize
libcaca
libcacard
libcanberra
libcanberra-pulse
libcap
libcap-ng
libcddb
libcdio
libcdio-paranoia
libcdr
libclc
libcloudproviders
libcmis
libconfig
libcroco
libcups
libcurl-compat
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libdc1394
libdca
libde265
libdrm
libdv
libdvbpsi
libdvdnav
libdvdread
libe-book
libebml
libedit
libelf
libepoxy
libepubgen
libetonyek
libev
libevdev
libevent
libexif
libexttextcat
libfdk-aac
libffi
libfontenc
libfreehand
libftdi
libgcrypt
libgdata
libgee
libglade
libglvnd
libgme
libgnome-keyring
libgnomekbd
libgpg-error
libgphoto2
libgssglue
libgtop
libgudev
libgusb
libgweather
libgxps
libhandy
libibus
libical
libice
libid3tag
libidn
libidn2
libiec61883
libieee1284
libimagequant
libimobiledevice
libindicator-gtk3
libinput
libinstpatch
libiscsi
libixion
libjpeg-turbo
libkate
libkeybinder3
libksba
liblangtag
libldap
liblouis
liblqr
liblrdf
libluv
libmad
libmateweather
libmatroska
libmaxminddb
libmfx
libmicrodns
libmicrohttpd
libmm-glib
libmms
libmng
libmnl
libmodplug
libmpack
libmpc
libmpcdec
libmpdclient
libmpeg2
libmspub
libmwaw
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnice
libnih
libnl
libnm
libnma
libnotify
libnsl
libnumbertext
liboauth
libodfgen
libofa
libogg
libomxil-bellagio
libopenraw
liborcus
libosinfo
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpeas
libpgm
libphonenumber
libpipeline
libpipewire02
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libpwquality
libqtxdg
libqxp
libraqm
libraw1394
libreoffice-still
libreoffice-still-ja
librevenge
librsvg
libsamplerate
libsasl
libsass
libseccomp
libsecret
libshout
libsidplay
libsigc++
libsigsegv
libslirp
libsm
libsndfile
libsodium
libsoup
libsoxr
libspectre
libspeechd
libspiro
libsrtp
libssh
libssh2
libstaroffice
libstemmer
libsynctex
libtar
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtiger
libtirpc
libtommath
libtool
libtorrent-rasterbar
libuninameslist
libunistring
libunwind
libupnp
liburcu
liburing
libusb
libusb-compat
libusbmuxd
libutempter
libutf8proc
libuv
libva
libvdpau
libvirt
libvirt-glib
libvirt-python
libvisio
libvisual
libvoikko
libvorbis
libvpx
libvterm
libwacom
libwebp
libwnck
libwnck3
libwpd
libwpe
libwpg
libwps
libx11
libx86
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxdamage
libxdg-basedir
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmu
libxnvctrl
libxpm
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxvmc
libxxf86vm
libyaml
libytnef
libzmf
licenses
lightdm
lilv
linux
linux-api-headers
linux-firmware
linux-headers
linux-lts
linux-lts-headers
linux-zen-docs
lirc
llvm-libs
lm_sensors
lmdb
lpsolve
lshw
lua
lua51
lua51-lpeg
lua51-mpack
lua52
luajit
luit
lv2
lvm2
lxc
lxcfs
lxd
lz4
lzo
lzop
m4
mailcap
make
mallard-ducktype
man-db
mate-desktop
mate-menus
mate-panel
mate-power-manager
mate-sensors-applet
mbedtls
mcomix
md4c
mdadm
media-player-info
memtester
mesa
meson
minizip
mjpegtools
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mpfr
mpg123
mplayer
mpv
msgpack-c
mtdev
mtools
mujs
mupdf
ncurses
ndctl
neon
neovim
net-snmp
netcf
netpbm
nettle
network-manager-applet
networkmanager
nginx
ninja
nm-connection-editor
node-gyp
nodejs
nodm
npm
npth
nspr
nss
ntfs-3g
ntp
numactl
nuspell
nvme-cli
oath-toolkit
obs-studio
ocl-icd
oniguruma
openal
opencl-headers
opencl-mesa
opencore-amr
openexr
openjade
openjpeg2
openmpi
opensc
opensp
openssh
openssl
opus
orc
osinfo-db
otf-ipaexfont
otf-ipafont
otf-ipamjfont
p11-kit
p7zip
pacman
pacman-contrib
pacman-mirrorlist
pahole
pam
pambase
pango
pangomm
paper
paprefs
parted
pasystray
patch
pavucontrol
pciutils
pcre
pcre2
pcsc-perl
pcsc-tools
pcsclite
perl
perl-alien-build
perl-alien-libxml2
perl-capture-tiny
perl-clone
perl-crypt-ssleay
perl-encode-locale
perl-error
perl-ffi-checklib
perl-file-chdir
perl-file-listing
perl-file-which
perl-html-parser
perl-html-tagset
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-io-socket-ssl
perl-ipc-run3
perl-libwww
perl-locale-gettext
perl-lwp-mediatypes
perl-lwp-protocol-https
perl-mailtools
perl-net-http
perl-net-ssleay
perl-parse-yapp
perl-path-class
perl-path-tiny
perl-rename
perl-sgmls
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
perl-xml-libxml
perl-xml-namespacesupport
perl-xml-parser
perl-xml-sax
perl-xml-sax-base
perl-xml-sax-expat
phodav
picom
pinentry
pixman
pkgconf
playerctl
polkit
polkit-qt5
poppler
poppler-glib
popt
portaudio
portsmf
potrace
powerline
powerline-common
powerline-fonts
procps-ng
protobuf
psmisc
psutils
pulseaudio
pulseaudio-alsa
pulseaudio-bluetooth
pyalpm
pyside2
python
python-anytree
python-appdirs
python-asn1crypto
python-attrs
python-babel
python-bcrypt
python-beaker
python-beautifulsoup4
python-cached-property
python-cairo
python-cffi
python-chardet
python-click
python-cryptography
python-dbus
python-dbus-common
python-distro
python-docker
python-docker-pycreds
python-dockerpty
python-docopt
python-docutils
python-dotenv
python-gobject
python-greenlet
python-i3ipc
python-idna
python-imagesize
python-importlib-metadata
python-isodate
python-jinja
python-jsonschema
python-lxml
python-lz4
python-mako
python-markdown
python-markupsafe
python-more-itertools
python-msgpack
python-mutagen
python-netifaces
python-opengl
python-ordered-set
python-packaging
python-paramiko
python-pillow
python-ply
python-powerline
python-pycountry
python-pycparser
python-pycryptodome
python-pycups
python-pycurl
python-pygments
python-pynacl
python-pynvim
python-pyparsing
python-pyqt5
python-pyqt5-sip
python-pyrsistent
python-pysocks
python-pytaglib
python-pytz
python-pyxdg
python-rencode
python-requests
python-selenium
python-setproctitle
python-setuptools
python-shiboken2
python-six
python-snowballstemmer
python-soupsieve
python-sphinx
python-sphinx-alabaster-theme
python-sphinx_rtd_theme
python-sphinxcontrib-applehelp
python-sphinxcontrib-devhelp
python-sphinxcontrib-htmlhelp
python-sphinxcontrib-jsmath
python-sphinxcontrib-qthelp
python-sphinxcontrib-serializinghtml
python-texttable
python-urllib3
python-websocket-client
python-xlib
python-yaml
python-zipp
python2
python2-appdirs
python2-cairo
python2-numpy
python2-ordered-set
python2-packaging
python2-pyparsing
python2-setuptools
python2-six
qemu
qpdf
qt5-base
qt5-declarative
qt5-location
qt5-multimedia
qt5-quickcontrols
qt5-speech
qt5-svg
qt5-tools
qt5-wayland
qt5-webchannel
qt5-webengine
qt5-x11extras
radeontool
raft
rapidjson
raptor
rasqal
rav1e
raw-thumbnailer
rdesktop
re2
readline
recode
redland
redshift
reflector
reiserfsprogs
remmina
rest
rhash
ripgrep
rofi
rpcbind
rsync
rtkit
rtmpdump
rubberband
ruby
ruby-irb
ruby-reline
rubygems
run-parts
runc
rxvt-unicode
rxvt-unicode-terminfo
sakura
samba
sane
sassc
sbc
screen
screenfetch
sddm
sdl
sdl2
sdl2_image
seabios
seahorse
sed
semver
serd
sgml-common
shaderc
shadow
shared-mime-info
slang
smartmontools
smbclient
snappy
sndio
solid
sonnet
sord
sound-theme-freedesktop
soundtouch
spandsp
spdlog
speex
speexdsp
spice
spice-gtk
spirv-tools
sqlite
squashfs-tools
sratom
srt
sshfs
stalonetray
startup-notification
streamlink
stress
sudo
suil
svt-hevc
sway
swaybg
sylpheed
sysfsutils
system-config-printer
systemd
systemd-libs
systemd-sysvcompat
t1lib
taglib
talloc
tar
tcl
tdb
telepathy-glib
tepl
tevent
texinfo
texlive-bibtexextra
texlive-bin
texlive-core
texlive-fontsextra
texlive-formatsextra
texlive-games
texlive-humanities
texlive-langjapanese
texlive-latexextra
texlive-music
texlive-pictures
texlive-pstricks
texlive-publishers
texlive-science
thin-provisioning-tools
thunar
thunar-volman
tidy
tlp
tlp-rdw
tp_smapi
tracker3
tree
tslib
ttf-croscore
ttf-dejavu
ttf-font-awesome
ttf-inconsolata
tumbler
twolame
tzdata
uchardet
udisks2
unarchiver
unibilium
unrar
unzip
upower
urxvt-perls
usbmuxd
usbredir
usbutils
util-linux
util-linux-libs
v4l-utils
vamp-plugin-sdk
vde2
vid.stab
vinagre
virglrenderer
virt-install
virt-manager
virtualbox-guest-iso
vlc
vmaf
volume_key
vte-common
vte3
vulkan-icd-loader
vulkan-radeon
w3m
wavpack
waybar
wayland
wayland-protocols
webkit2gtk
webrtc-audio-processing
wget
which
wildmidi
wine-mono
wine-staging
winetricks
wireless_tools
wlroots
wmctrl
woff2
wpa_supplicant
wpebackend-fdo
wqy-zenhei
wxgtk-common
wxgtk2
wxgtk3
x264
x265
xapp
xbitmaps
xcb-proto
xcb-util
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xclip
xdg-dbus-proxy
xdg-utils
xdotool
xf86-input-libinput
xf86-video-nouveau
xfce4-dev-tools
xfce4-panel
xfce4-power-manager
xfce4-pulseaudio-plugin
xfce4-screenshooter
xfconf
xfsdump
xfsprogs
xkeyboard-config
xmlsec
xmlto
xmobar
xmonad
xmonad-contrib
xorg-bdftopcf
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-xephyr
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmessage
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
xorgproto
xsel
xsensors
xterm
xvidcore
xxhash
xz
yajl
yarn
yelp-tools
yelp-xsl
you-get
youtube-dl
zbar
zeromq
zinnia
zip
zita-alsa-pcmi
zita-resampler
zlib
zsh
zstd
zvbi
zxing-cpp
zziplib
